FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_SAMV71_Xplained_AtmelStudio/libchip_samv7/include/samv7/component/component_pmc.h
#define CKGR_MOR_MOSCSEL                        ( 0x1u << 24 )                /**< \brief (CKGR_MOR) Main Oscillator Selection */
#define CKGR_MOR_CFDEN                          ( 0x1u << 25 )                /**< \brief (CKGR_MOR) Clock Failure Detector Enable */
#define CKGR_MOR_XT32KFME                       ( 0x1u << 26 )                /**< \brief (CKGR_MOR) Slow Crystal Oscillator Frequency Monitoring Enable */
/* -------- CKGR_MCFR : (PMC Offset: 0x0024) Main Clock Frequency Register -------- */
#define CKGR_MCFR_MAINF_Pos                     0
#define CKGR_MCFR_MAINF_Msk                     ( 0xffffu << CKGR_MCFR_MAINF_Pos ) /**< \brief (CKGR_MCFR) Main Clock Frequency */
#define CKGR_MCFR_MAINF( value )    ( ( CKGR_MCFR_MAINF_Msk & ( ( value ) << CKGR_MCFR_MAINF_Pos ) ) )
#define CKGR_MCFR_MAINFRDY                      ( 0x1u << 16 )                     /**< \brief (CKGR_MCFR) Main Clock Frequency Measure Ready */
#define CKGR_MCFR_RCMEAS                        ( 0x1u << 20 )                     /**< \brief (CKGR_MCFR) RC Oscillator Frequency Measure (write-only) */
#define CKGR_MCFR_CCSS                          ( 0x1u << 24 )                     /**< \brief (CKGR_MCFR) Counter Clock Source Selection */
/* -------- CKGR_PLLAR : (PMC Offset: 0x0028) PLLA Register -------- */
#define CKGR_PLLAR_DIVA_Pos                     0
#define CKGR_PLLAR_DIVA_Msk                     ( 0xffu << CKGR_PLLAR_DIVA_Pos )      /**< \brief (CKGR_PLLAR) PLLA Front End Divider */
#define CKGR_PLLAR_DIVA( value )    ( ( CKGR_PLLAR_DIVA_Msk & ( ( value ) << CKGR_PLLAR_DIVA_Pos ) ) )
#define   CKGR_PLLAR_DIVA_0                     ( 0x0u << 0 )                         /**< \brief (CKGR_PLLAR) Divider output is 0 and PLLA is disabled. */
#define   CKGR_PLLAR_DIVA_BYPASS                ( 0x1u << 0 )                         /**< \brief (CKGR_PLLAR) Divider is bypassed (divide by 1) and PLLA is enabled. */
#define CKGR_PLLAR_PLLACOUNT_Pos                8
#define CKGR_PLLAR_PLLACOUNT_Msk                ( 0x3fu << CKGR_PLLAR_PLLACOUNT_Pos ) /**< \brief (CKGR_PLLAR) PLLA Counter */
#define CKGR_PLLAR_PLLACOUNT( value )    ( ( CKGR_PLLAR_PLLACOUNT_Msk & ( ( value ) << CKGR_PLLAR_PLLACOUNT_Pos ) ) )
#define CKGR_PLLAR_MULA_Pos                     16
#define CKGR_PLLAR_MULA_Msk                     ( 0x7ffu << CKGR_PLLAR_MULA_Pos ) /**< \brief (CKGR_PLLAR) PLLA Multiplier */
#define CKGR_PLLAR_MULA( value )         ( ( CKGR_PLLAR_MULA_Msk & ( ( value ) << CKGR_PLLAR_MULA_Pos ) ) )
#define CKGR_PLLAR_ONE                          ( 0x1u << 29 )                    /**< \brief (CKGR_PLLAR) Must Be Set to 1 */
/* -------- PMC_MCKR : (PMC Offset: 0x0030) Master Clock Register -------- */
#define PMC_MCKR_CSS_Pos                        0
#define PMC_MCKR_CSS_Msk                        ( 0x3u << PMC_MCKR_CSS_Pos )   /**< \brief (PMC_MCKR) Master Clock Source Selection */
#define PMC_MCKR_CSS( value )    ( ( PMC_MCKR_CSS_Msk & ( ( value ) << PMC_MCKR_CSS_Pos ) ) )
#define   PMC_MCKR_CSS_SLOW_CLK                 ( 0x0u << 0 )                  /**< \brief (PMC_MCKR) Slow Clock is selected */
#define   PMC_MCKR_CSS_MAIN_CLK                 ( 0x1u << 0 )                  /**< \brief (PMC_MCKR) Main Clock is selected */
#define   PMC_MCKR_CSS_PLLA_CLK                 ( 0x2u << 0 )                  /**< \brief (PMC_MCKR) PLLA Clock is selected */
#define   PMC_MCKR_CSS_UPLL_CLK                 ( 0x3u << 0 )                  /**< \brief (PMC_MCKR) Divided UPLL Clock  is selected */
#define PMC_MCKR_PRES_Pos                       4
#define PMC_MCKR_PRES_Msk                       ( 0x7u << PMC_MCKR_PRES_Pos )  /**< \brief (PMC_MCKR) Processor Clock Prescaler */
#define PMC_MCKR_PRES( value )    ( ( PMC_MCKR_PRES_Msk & ( ( value ) << PMC_MCKR_PRES_Pos ) ) )
#define   PMC_MCKR_PRES_CLK_1                   ( 0x0u << 4 )                  /**< \brief (PMC_MCKR) Selected clock */
#define   PMC_MCKR_PRES_CLK_2                   ( 0x1u << 4 )                  /**< \brief (PMC_MCKR) Selected clock divided by 2 */
#define   PMC_MCKR_PRES_CLK_4                   ( 0x2u << 4 )                  /**< \brief (PMC_MCKR) Selected clock divided by 4 */
#define   PMC_MCKR_PRES_CLK_8                   ( 0x3u << 4 )                  /**< \brief (PMC_MCKR) Selected clock divided by 8 */
#define   PMC_MCKR_PRES_CLK_16                  ( 0x4u << 4 )                  /**< \brief (PMC_MCKR) Selected clock divided by 16 */
#define   PMC_MCKR_PRES_CLK_32                  ( 0x5u << 4 )                  /**< \brief (PMC_MCKR) Selected clock divided by 32 */
#define   PMC_MCKR_PRES_CLK_64                  ( 0x6u << 4 )                  /**< \brief (PMC_MCKR) Selected clock divided by 64 */
#define   PMC_MCKR_PRES_CLK_3                   ( 0x7u << 4 )                  /**< \brief (PMC_MCKR) Selected clock divided by 3 */
#define PMC_MCKR_MDIV_Pos                       8
#define PMC_MCKR_MDIV_Msk                       ( 0x3u << PMC_MCKR_MDIV_Pos )  /**< \brief (PMC_MCKR) Master Clock Division */
#define PMC_MCKR_MDIV( value )    ( ( PMC_MCKR_MDIV_Msk & ( ( value ) << PMC_MCKR_MDIV_Pos ) ) )
#define   PMC_MCKR_MDIV_EQ_PCK                  ( 0x0u << 8 )                  /**< \brief (PMC_MCKR) Master Clock is Prescaler Output Clock divided by 1. */
#define   PMC_MCKR_MDIV_PCK_DIV2                ( 0x1u << 8 )                  /**< \brief (PMC_MCKR) Master Clock is Prescaler Output Clock divided by 2. */
#define   PMC_MCKR_MDIV_PCK_DIV4                ( 0x2u << 8 )                  /**< \brief (PMC_MCKR) Master Clock is Prescaler Output Clock divided by 4. */
#define   PMC_MCKR_MDIV_PCK_DIV3                ( 0x3u << 8 )                  /**< \brief (PMC_MCKR) Master Clock is Prescaler Output Clock divided by 3. */
#define PMC_MCKR_UPLLDIV2                       ( 0x1u << 13 )                 /**< \brief (PMC_MCKR) UPLL Divisor by 2 */
/* -------- PMC_USB : (PMC Offset: 0x0038) USB Clock Register -------- */
#define PMC_USB_USBS                            ( 0x1u << 0 )                  /**< \brief (PMC_USB) USB Input Clock Selection */
#define PMC_USB_USBDIV_Pos                      8
#define PMC_USB_USBDIV_Msk                      ( 0xfu << PMC_USB_USBDIV_Pos ) /**< \brief (PMC_USB) Divider for USB Clock */
#define PMC_USB_USBDIV( value )    ( ( PMC_USB_USBDIV_Msk & ( ( value ) << PMC_USB_USBDIV_Pos ) ) )
/* -------- PMC_PCK[7] : (PMC Offset: 0x0040) Programmable Clock 0 Register -------- */
#define PMC_PCK_CSS_Pos                         0
#define PMC_PCK_CSS_Msk                         ( 0x7u << PMC_PCK_CSS_Pos )   /**< \brief (PMC_PCK[7]) Master Clock Source Selection */
#define PMC_PCK_CSS( value )    ( ( PMC_PCK_CSS_Msk & ( ( value ) << PMC_PCK_CSS_Pos ) ) )
#define   PMC_PCK_CSS_SLOW_CLK                  ( 0x0u << 0 )                 /**< \brief (PMC_PCK[7]) Slow Clock is selected */
#define   PMC_PCK_CSS_MAIN_CLK                  ( 0x1u << 0 )                 /**< \brief (PMC_PCK[7]) Main Clock is selected */
#define   PMC_PCK_CSS_PLLA_CLK                  ( 0x2u << 0 )                 /**< \brief (PMC_PCK[7]) PLLA Clock is selected */
#define   PMC_PCK_CSS_UPLL_CLK                  ( 0x3u << 0 )                 /**< \brief (PMC_PCK[7]) Divided UPLL Clock is selected */
#define   PMC_PCK_CSS_MCK                       ( 0x4u << 0 )                 /**< \brief (PMC_PCK[7]) Master Clock is selected */
#define PMC_PCK_PRES_Pos                        4
#define PMC_PCK_PRES_Msk                        ( 0xffu << PMC_PCK_PRES_Pos ) /**< \brief (PMC_PCK[7]) Programmable Clock Prescaler */
#define PMC_PCK_PRES( value )    ( ( PMC_PCK_PRES_Msk & ( ( value ) << PMC_PCK_PRES_Pos ) ) )
/* -------- PMC_IER : (PMC Offset: 0x0060) Interrupt Enable Register -------- */
#define PMC_IER_MOSCXTS                         ( 0x1u << 0 )                       /**< \brief (PMC_IER) Main Crystal Oscillator Status Interrupt Enable */
#define PMC_IER_LOCKA                           ( 0x1u << 1 )                       /**< \brief (PMC_IER) PLLA Lock Interrupt Enable */
#define PMC_IER_MCKRDY                          ( 0x1u << 3 )                       /**< \brief (PMC_IER) Master Clock Ready Interrupt Enable */
#define PMC_IER_LOCKU                           ( 0x1u << 6 )                       /**< \brief (PMC_IER) UTMI PLL Lock Interrupt Enable */
#define PMC_IER_PCKRDY0                         ( 0x1u << 8 )                       /**< \brief (PMC_IER) Programmable Clock Ready 0 Interrupt Enable */
#define PMC_IER_PCKRDY1                         ( 0x1u << 9 )                       /**< \brief (PMC_IER) Programmable Clock Ready 1 Interrupt Enable */
#define PMC_IER_PCKRDY2                         ( 0x1u << 10 )                      /**< \brief (PMC_IER) Programmable Clock Ready 2 Interrupt Enable */
#define PMC_IER_PCKRDY3                         ( 0x1u << 11 )                      /**< \brief (PMC_IER) Programmable Clock Ready 3 Interrupt Enable */
#define PMC_IER_PCKRDY4                         ( 0x1u << 12 )                      /**< \brief (PMC_IER) Programmable Clock Ready 4 Interrupt Enable */
#define PMC_IER_PCKRDY5                         ( 0x1u << 13 )                      /**< \brief (PMC_IER) Programmable Clock Ready 5 Interrupt Enable */
#define PMC_IER_PCKRDY6                         ( 0x1u << 14 )                      /**< \brief (PMC_IER) Programmable Clock Ready 6 Interrupt Enable */
#define PMC_IER_MOSCSELS                        ( 0x1u << 16 )                      /**< \brief (PMC_IER) Main Oscillator Selection Status Interrupt Enable */
#define PMC_IER_MOSCRCS                         ( 0x1u << 17 )                      /**< \brief (PMC_IER) Main On-Chip RC Status Interrupt Enable */
#define PMC_IER_CFDEV                           ( 0x1u << 18 )                      /**< \brief (PMC_IER) Clock Failure Detector Event Interrupt Enable */
#define PMC_IER_XT32KERR                        ( 0x1u << 21 )                      /**< \brief (PMC_IER) Slow Crystal Oscillator Error Interrupt Enable */
/* -------- PMC_IDR : (PMC Offset: 0x0064) Interrupt Disable Register -------- */
#define PMC_IDR_MOSCXTS                         ( 0x1u << 0 )                       /**< \brief (PMC_IDR) Main Crystal Oscillator Status Interrupt Disable */
#define PMC_IDR_LOCKA                           ( 0x1u << 1 )                       /**< \brief (PMC_IDR) PLLA Lock Interrupt Disable */
#define PMC_IDR_MCKRDY                          ( 0x1u << 3 )                       /**< \brief (PMC_IDR) Master Clock Ready Interrupt Disable */
#define PMC_IDR_LOCKU                           ( 0x1u << 6 )                       /**< \brief (PMC_IDR) UTMI PLL Lock Interrupt Disable */
#define PMC_IDR_PCKRDY0                         ( 0x1u << 8 )                       /**< \brief (PMC_IDR) Programmable Clock Ready 0 Interrupt Disable */
#define PMC_IDR_PCKRDY1                         ( 0x1u << 9 )                       /**< \brief (PMC_IDR) Programmable Clock Ready 1 Interrupt Disable */
#define PMC_IDR_PCKRDY2                         ( 0x1u << 10 )                      /**< \brief (PMC_IDR) Programmable Clock Ready 2 Interrupt Disable */
#define PMC_IDR_PCKRDY3                         ( 0x1u << 11 )                      /**< \brief (PMC_IDR) Programmable Clock Ready 3 Interrupt Disable */
#define PMC_IDR_PCKRDY4                         ( 0x1u << 12 )                      /**< \brief (PMC_IDR) Programmable Clock Ready 4 Interrupt Disable */
#define PMC_IDR_PCKRDY5                         ( 0x1u << 13 )                      /**< \brief (PMC_IDR) Programmable Clock Ready 5 Interrupt Disable */
#define PMC_IDR_PCKRDY6                         ( 0x1u << 14 )                      /**< \brief (PMC_IDR) Programmable Clock Ready 6 Interrupt Disable */
#define PMC_IDR_MOSCSELS                        ( 0x1u << 16 )                      /**< \brief (PMC_IDR) Main Oscillator Selection Status Interrupt Disable */
#define PMC_IDR_MOSCRCS                         ( 0x1u << 17 )                      /**< \brief (PMC_IDR) Main On-Chip RC Status Interrupt Disable */
#define PMC_IDR_CFDEV                           ( 0x1u << 18 )                      /**< \brief (PMC_IDR) Clock Failure Detector Event Interrupt Disable */
#define PMC_IDR_XT32KERR                        ( 0x1u << 21 )                      /**< \brief (PMC_IDR) Slow Crystal Oscillator Error Interrupt Disable */
/* -------- PMC_SR : (PMC Offset: 0x0068) Status Register -------- */
#define PMC_SR_MOSCXTS                          ( 0x1u << 0 )                       /**< \brief (PMC_SR) Main Crystal Oscillator Status */
#define PMC_SR_LOCKA                            ( 0x1u << 1 )                       /**< \brief (PMC_SR) PLLA Lock Status */
#define PMC_SR_MCKRDY                           ( 0x1u << 3 )                       /**< \brief (PMC_SR) Master Clock Status */
#define PMC_SR_LOCKU                            ( 0x1u << 6 )                       /**< \brief (PMC_SR) UTMI PLL Lock Status */
#define PMC_SR_OSCSELS                          ( 0x1u << 7 )                       /**< \brief (PMC_SR) Slow Clock Oscillator Selection */
#define PMC_SR_PCKRDY0                          ( 0x1u << 8 )                       /**< \brief (PMC_SR) Programmable Clock Ready Status */
#define PMC_SR_PCKRDY1                          ( 0x1u << 9 )                       /**< \brief (PMC_SR) Programmable Clock Ready Status */
#define PMC_SR_PCKRDY2                          ( 0x1u << 10 )                      /**< \brief (PMC_SR) Programmable Clock Ready Status */
#define PMC_SR_PCKRDY3                          ( 0x1u << 11 )                      /**< \brief (PMC_SR) Programmable Clock Ready Status */
#define PMC_SR_PCKRDY4                          ( 0x1u << 12 )                      /**< \brief (PMC_SR) Programmable Clock Ready Status */
#define PMC_SR_PCKRDY5                          ( 0x1u << 13 )                      /**< \brief (PMC_SR) Programmable Clock Ready Status */
#define PMC_SR_PCKRDY6                          ( 0x1u << 14 )                      /**< \brief (PMC_SR) Programmable Clock Ready Status */
#define PMC_SR_MOSCSELS                         ( 0x1u << 16 )                      /**< \brief (PMC_SR) Main Oscillator Selection Status */
#define PMC_SR_MOSCRCS                          ( 0x1u << 17 )                      /**< \brief (PMC_SR) Main On-Chip RC Oscillator Status */
#define PMC_SR_CFDEV                            ( 0x1u << 18 )                      /**< \brief (PMC_SR) Clock Failure Detector Event */
#define PMC_SR_CFDS                             ( 0x1u << 19 )                      /**< \brief (PMC_SR) Clock Failure Detector Status */
#define PMC_SR_FOS                              ( 0x1u << 20 )                      /**< \brief (PMC_SR) Clock Failure Detector Fault Output Status */
#define PMC_SR_XT32KERR                         ( 0x1u << 21 )                      /**< \brief (PMC_SR) Slow Crystal Oscillator Error */
/* -------- PMC_IMR : (PMC Offset: 0x006C) Interrupt Mask Register -------- */
#define PMC_IMR_MOSCXTS                         ( 0x1u << 0 )                       /**< \brief (PMC_IMR) Main Crystal Oscillator Status Interrupt Mask */
#define PMC_IMR_LOCKA                           ( 0x1u << 1 )                       /**< \brief (PMC_IMR) PLLA Lock Interrupt Mask */
#define PMC_IMR_MCKRDY                          ( 0x1u << 3 )                       /**< \brief (PMC_IMR) Master Clock Ready Interrupt Mask */
#define PMC_IMR_LOCKU                           ( 0x1u << 6 )                       /**< \brief (PMC_IMR) UTMI PLL Lock Interrupt Mask */
#define PMC_IMR_PCKRDY0                         ( 0x1u << 8 )                       /**< \brief (PMC_IMR) Programmable Clock Ready 0 Interrupt Mask */
#define PMC_IMR_PCKRDY1                         ( 0x1u << 9 )                       /**< \brief (PMC_IMR) Programmable Clock Ready 1 Interrupt Mask */
#define PMC_IMR_PCKRDY2                         ( 0x1u << 10 )                      /**< \brief (PMC_IMR) Programmable Clock Ready 2 Interrupt Mask */
#define PMC_IMR_MOSCSELS                        ( 0x1u << 16 )                      /**< \brief (PMC_IMR) Main Oscillator Selection Status Interrupt Mask */
#define PMC_IMR_MOSCRCS                         ( 0x1u << 17 )                      /**< \brief (PMC_IMR) Main On-Chip RC Status Interrupt Mask */
#define PMC_IMR_CFDEV                           ( 0x1u << 18 )                      /**< \brief (PMC_IMR) Clock Failure Detector Event Interrupt Mask */
#define PMC_IMR_XT32KERR                        ( 0x1u << 21 )                      /**< \brief (PMC_IMR) Slow Crystal Oscillator Error Interrupt Mask */
/* -------- PMC_FSMR : (PMC Offset: 0x0070) Fast Startup Mode Register -------- */
#define PMC_FSMR_FSTT0                          ( 0x1u << 0 )                       /**< \brief (PMC_FSMR) Fast Startup Input Enable 0 */
#define PMC_FSMR_FSTT1                          ( 0x1u << 1 )                       /**< \brief (PMC_FSMR) Fast Startup Input Enable 1 */
#define PMC_FSMR_FSTT2                          ( 0x1u << 2 )                       /**< \brief (PMC_FSMR) Fast Startup Input Enable 2 */
#define PMC_FSMR_FSTT3                          ( 0x1u << 3 )                       /**< \brief (PMC_FSMR) Fast Startup Input Enable 3 */
#define PMC_FSMR_FSTT4                          ( 0x1u << 4 )                       /**< \brief (PMC_FSMR) Fast Startup Input Enable 4 */
#define PMC_FSMR_FSTT5                          ( 0x1u << 5 )                       /**< \brief (PMC_FSMR) Fast Startup Input Enable 5 */
#define PMC_FSMR_FSTT6                          ( 0x1u << 6 )                       /**< \brief (PMC_FSMR) Fast Startup Input Enable 6 */
#define PMC_FSMR_FSTT7                          ( 0x1u << 7 )                       /**< \brief (PMC_FSMR) Fast Startup Input Enable 7 */
#define PMC_FSMR_FSTT8                          ( 0x1u << 8 )                       /**< \brief (PMC_FSMR) Fast Startup Input Enable 8 */
#define PMC_FSMR_FSTT9                          ( 0x1u << 9 )                       /**< \brief (PMC_FSMR) Fast Startup Input Enable 9 */
#define PMC_FSMR_FSTT10                         ( 0x1u << 10 )                      /**< \brief (PMC_FSMR) Fast Startup Input Enable 10 */
#define PMC_FSMR_FSTT11                         ( 0x1u << 11 )                      /**< \brief (PMC_FSMR) Fast Startup Input Enable 11 */
#define PMC_FSMR_FSTT12                         ( 0x1u << 12 )                      /**< \brief (PMC_FSMR) Fast Startup Input Enable 12 */
#define PMC_FSMR_FSTT13                         ( 0x1u << 13 )                      /**< \brief (PMC_FSMR) Fast Startup Input Enable 13 */
#define PMC_FSMR_FSTT14                         ( 0x1u << 14 )                      /**< \brief (PMC_FSMR) Fast Startup Input Enable 14 */
#define PMC_FSMR_FSTT15                         ( 0x1u << 15 )                      /**< \brief (PMC_FSMR) Fast Startup Input Enable 15 */
#define PMC_FSMR_RTTAL                          ( 0x1u << 16 )                      /**< \brief (PMC_FSMR) RTT Alarm Enable */
#define PMC_FSMR_RTCAL                          ( 0x1u << 17 )                      /**< \brief (PMC_FSMR) RTC Alarm Enable */
#define PMC_FSMR_USBAL                          ( 0x1u << 18 )                      /**< \brief (PMC_FSMR) USB Alarm Enable */
#define PMC_FSMR_LPM                            ( 0x1u << 20 )                      /**< \brief (PMC_FSMR) Low-power Mode */
#define PMC_FSMR_FLPM_Pos                       21
#define PMC_FSMR_FLPM_Msk                       ( 0x3u << PMC_FSMR_FLPM_Pos )       /**< \brief (PMC_FSMR) Flash Low-power Mode */
#define PMC_FSMR_FLPM( value )    ( ( PMC_FSMR_FLPM_Msk & ( ( value ) << PMC_FSMR_FLPM_Pos ) ) )
#define   PMC_FSMR_FLPM_FLASH_STANDBY           ( 0x0u << 21 )                      /**< \brief (PMC_FSMR) Flash is in Standby Mode when system enters Wait Mode */
#define   PMC_FSMR_FLPM_FLASH_DEEP_POWERDOWN    ( 0x1u << 21 )                      /**< \brief (PMC_FSMR) Flash is in Deep-power-down mode when system enters Wait Mode */
#define   PMC_FSMR_FLPM_FLASH_IDLE              ( 0x2u << 21 )                      /**< \brief (PMC_FSMR) Idle mode */
#define PMC_FSMR_FFLPM                          ( 0x1u << 23 )                      /**< \brief (PMC_FSMR) Force Flash Low-power Mode */
/* -------- PMC_FSPR : (PMC Offset: 0x0074) Fast Startup Polarity Register -------- */
#define PMC_FSPR_FSTP0                          ( 0x1u << 0 )                       /**< \brief (PMC_FSPR) Fast Startup Input Polarity 0 */
#define PMC_FSPR_FSTP1                          ( 0x1u << 1 )                       /**< \brief (PMC_FSPR) Fast Startup Input Polarity 1 */
#define PMC_FSPR_FSTP2                          ( 0x1u << 2 )                       /**< \brief (PMC_FSPR) Fast Startup Input Polarity 2 */
#define PMC_FSPR_FSTP3                          ( 0x1u << 3 )                       /**< \brief (PMC_FSPR) Fast Startup Input Polarity 3 */
#define PMC_FSPR_FSTP4                          ( 0x1u << 4 )                       /**< \brief (PMC_FSPR) Fast Startup Input Polarity 4 */
#define PMC_FSPR_FSTP5                          ( 0x1u << 5 )                       /**< \brief (PMC_FSPR) Fast Startup Input Polarity 5 */
#define PMC_FSPR_FSTP6                          ( 0x1u << 6 )                       /**< \brief (PMC_FSPR) Fast Startup Input Polarity 6 */
#define PMC_FSPR_FSTP7                          ( 0x1u << 7 )                       /**< \brief (PMC_FSPR) Fast Startup Input Polarity 7 */
#define PMC_FSPR_FSTP8                          ( 0x1u << 8 )                       /**< \brief (PMC_FSPR) Fast Startup Input Polarity 8 */
#define PMC_FSPR_FSTP9                          ( 0x1u << 9 )                       /**< \brief (PMC_FSPR) Fast Startup Input Polarity 9 */
#define PMC_FSPR_FSTP10                         ( 0x1u << 10 )                      /**< \brief (PMC_FSPR) Fast Startup Input Polarity 10 */
#define PMC_FSPR_FSTP11                         ( 0x1u << 11 )                      /**< \brief (PMC_FSPR) Fast Startup Input Polarity 11 */
#define PMC_FSPR_FSTP12                         ( 0x1u << 12 )                      /**< \brief (PMC_FSPR) Fast Startup Input Polarity 12 */
#define PMC_FSPR_FSTP13                         ( 0x1u << 13 )                      /**< \brief (PMC_FSPR) Fast Startup Input Polarity 13 */
#define PMC_FSPR_FSTP14                         ( 0x1u << 14 )                      /**< \brief (PMC_FSPR) Fast Startup Input Polarity 14 */
#define PMC_FSPR_FSTP15                         ( 0x1u << 15 )                      /**< \brief (PMC_FSPR) Fast Startup Input Polarity 15 */
/* -------- PMC_FOCR : (PMC Offset: 0x0078) Fault Output Clear Register -------- */
#define PMC_FOCR_FOCLR                          ( 0x1u << 0 )                       /**< \brief (PMC_FOCR) Fault Output Clear */
/* -------- PMC_WPMR : (PMC Offset: 0x00E4) Write Protection Mode Register -------- */
#define PMC_WPMR_WPEN                           ( 0x1u << 0 )                       /**< \brief (PMC_WPMR) Write Protection Enable */
#define PMC_WPMR_WPKEY_Pos                      8
#define PMC_WPMR_WPKEY_Msk                      ( 0xffffffu << PMC_WPMR_WPKEY_Pos ) /**< \brief (PMC_WPMR) Write Protection Key */
#define PMC_WPMR_WPKEY( value )    ( ( PMC_WPMR_WPKEY_Msk & ( ( value ) << PMC_WPMR_WPKEY_Pos ) ) )
#define   PMC_WPMR_WPKEY_PASSWD                 ( 0x504D43u << 8 )                  /**< \brief (PMC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0. */
/* -------- PMC_WPSR : (PMC Offset: 0x00E8) Write Protection Status Register -------- */
#define PMC_WPSR_WPVS                           ( 0x1u << 0 )                       /**< \brief (PMC_WPSR) Write Protection Violation Status */
#define PMC_WPSR_WPVSRC_Pos                     8
#define PMC_WPSR_WPVSRC_Msk                     ( 0xffffu << PMC_WPSR_WPVSRC_Pos )  /**< \brief (PMC_WPSR) Write Protection Violation Source */
